{"pages":[{"title":"about","text":"Voyage.shと管理人についてサクッと紹介しておきます。 Voyage.shVoyage.shは基本的に管理人の気になった様々な事について書いていきます。例えば、歴史関係や音楽関係、ゲーム関連、はたまたシェルスクリプト・シェル芸関連…etcなどといった事を書いていきます。 ※因みに「シェル芸」とはこのページによると、 マウスも使わず、ソースコードも残さず、GUIツールを立ち上げる間もなく、あらゆる調査・計算・テキスト処理をCLI端末へのコマンド入力一撃で終わらすこと。あるいはそのときのコマンド入力のこと。 とされています。 redpeacock78(管理人)京都在住の町中でプラプラしてる平々凡々な大学生(芸大生)の一人。 Main LanguageShell ScriptRuby(少しだけ…)","link":"/about/index.html"},{"title":"","text":"","link":"/categories/index.html"},{"title":"All tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"シェル芸で約数を表示させる方法","text":"きっかけタイトルにある通りある時ふとある整数に対する約数の一覧が欲しくなった時があった。そこでシェル芸でできないか試行錯誤してみた。 結果$ yes 220 | head -n220 | awk '{print $1/NR}' | grep -vF --line-buffered . | tac 1 2 4 5 10 11 20 22 44 55 110 220 なんとか出来た。 解説まずyesで求めたい整数を出力してheadでその整数と同じ数だけの行を取得、 $ yes 10 | head -n10 10 10 10 10 10 10 10 10 10 10 次にawkを使ってそれぞれの行番号を使って出力された整数を割っていきます。 $ yes 10 | head -n10 | awk '{print $1/NR}' 10 5 3.33333 2.5 2 1.66667 1.42857 1.25 1.11111 1 そして小数点が含まれているものを除外するためにgrepの-v(パターンに一致しない行を表示)と-F(固定文字列の検索)を使います。(–line-bufferedはバッファさせないために指定しています。) $ yes 10 | head -n220 | awk '{print $1/NR}' | grep -vF --line-buffered . 10 5 2 1 最後にtacで逆順に表示すれば上から順に小→大の順に表示されます。 $ yes 10 | head -n220 | awk '{print $1/NR}' | grep -vF --line-buffered . | tac 1 2 5 10 …ただこれがどんな場面で活躍するかは謎。","link":"/oneliner/5MHtkNH5L6/"},{"title":"公的文書と筆記具の関係性についての簡単な考察","text":"過去書いた簡単な考察レポートのまとめと備忘録。 公的文書で使用可能な「筆記具」 万年筆水性インクのもの。具体的にはカーボンブラックやブルーブラックインク。 油性ボールペン1970年代に公文書への使用が認められる。 ゲルインク及び水性染料インクなど「JIS S6061」に従って試験を行い、その結果が公文書使用可能なもの。 法律等に定められた規定 法律上は、公用文の書き表し方の基準:資料集 文化庁編 102Pに 「（起案文書の作成）第12条 起案文書を作成するときは、『公用文作成の要領』（中略）『公文書の書式と文例』（昭和34年11月文総往第103号）によるものとし、文字はインキを用いて正しくていねいに書くように努めねばならない。」 と記されている。つまり昭和34年には既にインクを用いて書くことが明文化され、それに対するマニュアルなども策定されていたようである。 またJISには2010年に「JIS S 6061:2010 ゲルインキ及びレフィル」にゲルインクと水性ペンについてはっきりと明記されている。 考察 公的文書はあくまでも公的な性格を大きく持つ。また、「長期保存」及び「情報の共有」を前提としている。つまりは、書類としての物質的耐久性が必要となってくるためにインクの使用が前提となっているのだろう。しかし今後は順当に行けば、書類の電子化が大きく進んでいき手書きの書類の使用率も徐々に下がってくるのではないかと推測される。 しかし、日本において未だに手書きによる文書及び書類は非常に多い。その原因の一つになっているのはおそらく明治33年に交付された法律第17条にある、「記名捺印で良い」という趣旨の記述であると思われる。この一文が未だに法的効力を持つが故にハンコ万能主義の法的根拠となることが「手書き」が多い事の原因となっているのではないかと推測される。 しかし、個人的には古文書などを勉強している立場からしてみれば、歴史的経緯から見るにハンコなどよりも圧倒的に欧米圏でいうサインに当たる「花押(かおう)」の方が法的効力を持つように思う。(事実、古文書を鑑定などする際にも非常に重要な部分となる。)しかし、2016年の6月3日に最高裁が沖縄県の男性が2003年に死亡する前に作成した遺言状に花押が使用されていたためにその遺言状は「無効」であると判決を下した例があるように、この「署名捺印」という問題は今の現代日本を取り巻き象徴するような非常に根の深い問題であるとも考えられる。 参考資料・文献 書籍文化庁 「公用文の書き表し方の基準:資料集」 大蔵省印刷局 1974/3新関欽哉 「ハンコの文化史:古代ギリシャから現代日本まで」 吉川弘文館 2015/6 URL「JIS S 6061:2010 ゲルインキボールペン及びレフィル」公文書と筆記具についてです。油性、筆ペン、万年筆…仕事で使い分けるコツ公的文書 ボールペンは何を使う | nanchan遺言書：「花押」は無効 最高裁 - 毎日新聞最高裁、花押を「印」と認めず…遺言書「無効」 の話 – 行政書士酒井茂仁事務所","link":"/memo/consideration/THbQmJw9Yb/"},{"title":"平安神宮と内国勧業博覧会","text":"大学のレポートやら何やらを書くために調べたことのまとめと備忘録。 「内国勧業博覧会」って何？ 18世紀後半に所謂「産業革命」が起きて以降、19世紀に入ると工業化した国々で万国博覧会が開催される様になりました。基本的に当時の万国博覧会は、国際的な「見本市」という性格が強かったため、当時の明治政府は「産業の奨励」と「国民の啓蒙政策」の一環として万国博覧会へ出品することをメインに据えながら、自国のアピールを兼ねた内国(日本)での「勧業博覧会」の開催に注力していきました。 そうして、開かれたのが「内国勧業博覧会」であり、第一回の開催地は東京上野公園での開催でした。ちなみに全部でおよそ5回開催されています。（それぞれ、第一回〜第三回までは東京上野公園、第四回は京都岡崎、第五回は大阪天王寺） 「京都」と「内国勧業博覧会」 明治初期、東京（江戸）への遷都などの様々な要因によって京都が急速に衰退・荒廃を見せていく中、京都の行政は近代化などの様々な復興策を打ち出していきます。その中の一つとして明治25年に企画されたのが「平安遷都1100年祭」という、イベントでした。その企画の中で京都活性化の起爆剤にしていきたいと、招致活動を続けていきます。 その結果、第四回内国勧業博覧会の開催地として京都・左京区にある「岡崎」という土地が選ばれることになります。 「平安神宮」の建設 「京都は古い社寺が多いし多分此処も歴史の古い所なのだろう」 と観光に訪れたりして漠然と思われてはいないでしょうか？ 確かにそれは基本的には間違ってはいないのですが、何事にも例外というものは付き物です。 実は平安神宮は先ほどて来た、「平安遷都1100年祭」というイベントひいては第四回内国勧業博覧会のために建設されたと言っても過言ではありません。平安神宮が建てられたのは、明治28年（1895年）と実は京都の中の寺社では非常にごく最近建てられたものになるのです。（2019年当時で創建からおよそ単純計算で124年程。） 計画としては、明治28年4月1日に平安遷都1100年を記念して京都で開催された第4回内国勧業博覧会の目玉として平安京遷都当時の大内裏の一部（朝堂院）を平安京の頃の残されていた資料を基に復元し、それを博覧会のメインパビリオンとして復元するものでした。そして、博覧会の終了後は「この建物を神社として残し、雅やかな京都を後世まで伝えていこう」という声が多く聞こえて来たという経緯から、今に残る平安神宮が出来たのです。 また、平安神宮には平安京遷都のおり天皇だった「遷都のおや神様」で第50代桓武天皇が祭神として祀られています。 ちなみに、設計は伊東忠太・ 木子清敬・佐々木岩次郎の3名によって行われており、社殿は朝堂院を長さ比で約8分の5に縮小して復元したものになっています。また、大きく赤く光る朱色が特徴的な正面の門は、朝堂院の應天門を模していて、さらにその内側の左右の殿舎は朝集堂の再現になっていて、外拝殿は朝堂院の正殿である大極殿を模しています。 また、2010年12月には、大極殿など6棟が国の重要文化財に指定され、参道の大鳥居は国の登録有形文化財に登録されています。 参考資料 URL京都の中では若い神社の一つの平安神宮には、こんな歴史が残されていた！ _ wondertrip平安神宮と博覧会 いり豆 歴史談義 - 楽天ブログ平安神宮 - Wikipedia[公式]Heian Jingu Shrine 平安神宮 京都 平安神宮の参拝情報と神前結婚式・七五三など各種ご祈祷、名勝神苑のご紹介内国勧業博覧会 - Wikipedia第4回内国勧業博覧会 第1部 1900年までに開催された博覧会 博覧会―近代技術の展示場2012-04-15 講座「第四回内国勧業博覧会と京都」、京都会館にて-「日常旅行日記」 I Love Kyoto Kaikan","link":"/memo/history/7BQQZ3irIi/"},{"title":"西陣織の歴史と織機の発展","text":"昔に書いた発表用の研究レポートの内容のまとめと備忘録。 西陣織の歴史平安時代以前の西陣織 西陣織のルーツについては古墳時代のおよそ5、6世紀のあたりに遡る事になる。調べてみると、大陸からの渡来人である秦氏の一族が山城の国、つまり今の京都・太秦あたりに住みつき、養蚕と絹織物の技術を伝えたということが今の西陣織の直接的なルーツの様である。またこの頃には、原始的な居座機が改良され飛躍的な発展を遂げていた事が分かっている。その後、5世紀前半には筬梭機(おさひばた)というものが輸入され絹織の技術が伝わったが、畿内の一部に限られたため今までの織機と並行的に利用されていた*1ようである。 また、平安時代中期以降になると織部町の近くの大舎人(おおとねり)町に集まり住み始め、鎌倉時代には「大舎人の綾」とか「大宮の絹」等と呼ばれ珍重された織物を生産していた事が分かっている。そして室町時代には、大舎人座という同業組合のようなものを組織し、朝廷の内蔵寮(うちのくらのつかさ)からの需要に応えながら、一般の公家や武家などの注文にも応じていたというこ事が分かっている。 また、この時期に大陸から高機(空引機)を取り入れ、先に染めた糸を使って色柄や模様を織り出す紋織(いわゆる西陣織の特徴*2の一つである『先染(さきぞめ)の紋織物』)が可能になり、高級絹織物・西陣織の基礎が築かれ、その産地としての西陣が確立されていった様である。 平安時代以降の西陣織 そして、室町時代の中期頃に「西陣織」の名前の由来となった応仁の乱(1467〜1477年)が起こり、一時は多くの職工たちが戦火を逃れて和泉の堺などに移り住んだ事により、大舎人町の織物業は壊滅状態となってしまう。しかし、その後室町時代の末頃には白雲村(現在の上京区新町今出川上ル付近)や、戦乱時に西軍の本陣であった大宮今出川付近で織物業を再開していき、大舎人座を復活させ伝統ある京都の絹織物業を代表するものとして認められていくようになっていった。またその後、西陣織とその産地・西陣は朝廷からも認められ、豊臣秀吉などによる保護を受けながら明の技術を取り入れたりしながら発展していった。 そして、江戸時代になり世の中が安定し町人文化が台頭してくると高級織物の産地である西陣はさらに繁栄し、大きな糸問屋や織屋が立ち並ぶ織屋街が形成されていき、高級織物はもとより”ちりめん”や”縞”に至るまで織り出しいった。 その後明治時代までいくと、その当時西陣は海外の先進技術を導入することにかなり積極的だったため、フランスのリヨンからジャカード織機を輸入してきたことが今の西陣織にも繋がっている。 西陣織の織機の変遷 まず大まかな織機の変遷は、「居座機(いざりばた)」→「綴機(つづればた)」→「高機(たかはた)(空引機(そらひきばた))」→「手機」→「力織機」という流れである。また、1872年(明治5年)にフランスのリヨンに職人の井上伊兵衛と佐倉常七と吉田忠七を派遣し導入したジャカード(Jacquard)織機*3や、1873年(明治6年)のウィーン万国博覧会に随行した織物業者の四世伊達弥助が持ち帰ったオーストリア式のジャカードなどが今の西陣織に繋がる重要な転換点だったようである。 さらに、西陣織においてはジャカード織機のデータ読み取り部”のみ”が電子化した「ダイレクトジャカード」と呼ばれるものへ独自の発展を見せている。また、その「ダイレクトジャカード」はほぼ日本においてのみで使用されている。 参考資料西陣織 – Wikipedia西陣の歴史 | 西陣織工業組合西陣織のできるまで:西陣web西陣織の歴史と成り立ち、特徴について西陣織(にしじんおり・京都府)の特徴 - KOGEI JAPAN(コウゲイジャパン)西陣の由来 | 西陣織工業組合地機と高機の違い - 本場結城紬岩田織物文化史 12 西陣織[PDF]機の歴史 1: 現在では理由は違うが綴機、手機、力織機はそれぞれ目的別に今でも全てを機械化したり等はせずに併用されている。2: 経済産業省指定伝統的工芸品として指定されている西陣織の特徴は https://shikinobi.com/nishijin-ori が詳しい。3: フランスではジャカードという技術を国家が買い取り、「門外不出」としていた。しかし西陣は、フランスのリヨンまで職人たちを派遣し、「門外不出」とされていたジャカード技術を西陣の莫大な資金を投じて輸入している。","link":"/memo/history/YKhUSOdikK/"},{"title":"湯神社及び初子祭について","text":"昔書いたレポート資料のまとめと備忘録。 湯神社概要湯神社の現在の所在地は愛媛県松山市道後湯之町4-10である。ただ、創建時期は不明だが当初は今の場所(冠山（かんむりやま）)にあった訳ではなく鷺谷(さぎだに)というところの大禅寺の前にあったとされている。また、この神社に祀られている二柱である大己(オオナム)貴命(チノミコト)(大国(オオクニ)主命(ヌシノミコト))と少彦名命(スクナヒコナノミコト)は道後温泉の起源譚において道後温泉を発見した神とされている。 来歴湯神社の来歴には様々な説があるようだが、『日本歴史地名体系 39 愛媛県の地名』には、 「冠山にある。大己貴命・少彦名命の二神を祭祀する。創建当時は鷺谷の大禅寺の前にあったという。同じ式内社の出雲(いずもの)崗(おか)神社は奇(クシ)稲田(ナダ)姫命(ヒメノミコト)すなわち素戔鳴命(スサノオノミコト)の妃で 大己貴命の母を祭神とし、冠山にあった。湯神社が微衰した時、出雲崗神社の本殿に合祀された。ところがいつの間にか本殿が湯神社となり、出雲崗神社は江戸時代初期に境内の一小祠に移されて祀られることになった(大日本史、愛媛面影)。」 とある。また、『伊予見聞録 Vol.18(『松山百点 vol.184』収録)』によると、湯神社の祭神である二神、大己貴命・少彦名命による道後温泉の起源、湯神社の祭神となった理由は、 「昔々、このお二人の神様が、出雲の国から伊予の道後のあたりを巡られた折り、突然少彦名命が気を失われた。大国主命が何か治す手だてはないものかと考えておられると、湯気の立つ沼に足に傷を負った白鷺が何度も出たりはいったりしている。そこで、大国主命が少彦名命を手の平にお乗せになり、湧き出る湯に温められると病は平癒したという。これが道後温泉の発見であり、この二神が温泉の守護神とされる謂れである。」 と記載されている。 そして、史実として残る神社の詳細は『全國神社名鑒(めいかん) 下巻』に 「由緒＝延喜式内(えんぎしきだい)伊予(いよの)国(くに)温泉郡(おんせんぐん)湯神社で景行(けいこう)天皇が当社を建て、湯地の主としたといわれる。上古は湯の岡穂の木に鎮座。大永七年国司河野通直(みちなお)が出雲崗神社へ移し、併せて湯月大明神と称した。元禄年間それぞれ旧号に復し、宝永五年旧藩主より別社を建て奉斎したが、明治四年湯神社と相殿に奉斎した。旧県社。」 とある。また『愛媛県神社誌』には、醍醐天皇が延長五年に勅撰された延喜式五十巻の内の第九・十巻の神名帳に登録された神々が奉斎されている神社(式社・式内社)として、愛媛県内の二十四社のうちの由緒ある古社の一社に、 「○式内社(中略)○温泉郡四座(大一座 小三座)(中略)湯神社 松山市道後湯之町冠山」 と記載されている。 初子祭(はつねさん)来歴初子祭の起源・来歴について、『角川日本地名大辞典 38 愛媛県』には、 「当社では、古くから初子祭が11月の子の日に盛大に行われた。その起源は、 大己貴命が鼠に救われたという「古事記」の古伝説から、いつしか鼠を十二支の子に結びつけたことに基づいたのであろう。陰暦の11月が子の月に当たるので、この月の初めの子の日を選んだと思われる。」 と記載されており、また『愛媛県百科大事典 下巻㋜〜㋻』には、 「一月十五、十六の両日に行われる初子祭は、江戸時代から続いているもので、商売繁盛、家内安全を願う多数の参拝客で賑わう。」 と記されていることから、由来としては「古事記」に基づおり、現在の形になっていったのは江戸時代の頃と推測される。また現在では、初子祭が行われるのは成人の日とその前日となっており毎年日付が変わる。 概要 餅撒き「縁起の餅撒き」とされ、餅を「福」と見立てて投げられた餅をつかむことによって、その年一年の幸福などを祈るとされていまる。この餅撒きは、催事中の二日間に数回行われる。 神符(守札)焼上祭 (どんと焼き)主に、全国的には左義長(さぎちょう)等と呼ばれるものです。一年間使用した御守や御札(正月飾りなども含まれています。)に火切金で火花を飛ばし火を付け焚き上げます。また、この火で焼いたお餅を食べると「無病息災」になると言われています。また、一般的には「どんと焼き」と呼ばれているので歳神様を祭る慣わしが主体的にあった出雲方面の風習がルーツと考えられます。 福引元々は神託的な意味合いを持っており、年始に、二人が餅を引っ張り合ってそれがどのようにちぎれるかを見てその年の吉兆を占ったのが始まりと言われている。 縁起笹の販売縁起笹(えんぎささ)と呼ばれているもので、「枯れても葉の落ちない縁起笹」とされており、いわゆる縁起物。 獅子舞周囲の邪気や災いを払うとされている。獅子に頭を噛まれると魔除けになり、一年をより良く過ごすことが出来る、と言われている。また、愛媛県松山地区は演目が何種類かあり、それぞれがストーリー性に富んでいるというのが特徴。また、獅子の頭は一本角が主流。 参考文献・資料 書籍全国神社名鑑・史学センター・三浦譲 『全國神社名鑒 下巻』1997/7/15「角川日本地名大辞典」編纂委員会・竹内理三・角川春樹・株式会社角川書店『角川地名大辞典 38 愛媛県』凸版印刷株式会社 1981/10/8愛媛新聞社・松下功・愛媛新聞社『愛媛県百科大事典 下巻㋜〜㋻』 凸版印刷株式会社 1985/6/1愛媛県神社庁『愛媛県神社誌』株式会社関洋紙店印刷所 1974/3/1平凡社『日本歴史地名体系 39 愛媛県の地名』1980/11松山百点会「伊予見聞録 Vol.18」『松山百点 vol.184」1995 URL獅子舞 − Wikipedia福引 − Wikipedia左義長 − Wikipedia獅子舞の意味や由来とは？頭を噛むのはなぜ？ − 日本文化研究ブログ -Japan Culture Lab獅子舞の意味と由来 – ODN愛媛の祭り１０ 松山市の獅子舞（ししまい） − 愛媛県歴史文化博物館 学芸員ブログ『研究室から』湯神社湯神社写真帳湯神社 − Wikipedia湯神社 − いよ観ネット湯神社 愛媛県松山市道後湯之町 − 神奈備にようこそ","link":"/memo/history/RQ923qmryV/"}],"tags":[{"name":"シェル芸","slug":"shellgei","link":"/tags/shellgei/"},{"name":"歴史","slug":"history","link":"/tags/history/"},{"name":"法律","slug":"law","link":"/tags/law/"},{"name":"文房具","slug":"stationery","link":"/tags/stationery/"},{"name":"京都","slug":"kyoto","link":"/tags/kyoto/"},{"name":"寺社","slug":"shrine-temple","link":"/tags/shrine-temple/"},{"name":"伝統産業","slug":"traditional-industry","link":"/tags/traditional-industry/"},{"name":"愛媛","slug":"ehime","link":"/tags/ehime/"}],"categories":[{"name":"ワンライナー","slug":"oneliner","link":"/categories/oneliner/"},{"name":"備忘録","slug":"memo","link":"/categories/memo/"},{"name":"考察","slug":"memo/consideration","link":"/categories/memo/consideration/"},{"name":"歴史","slug":"memo/history","link":"/categories/memo/history/"}]}